app/controllers/books_controller.rb

SELECT "books".* FROM "books"
INSERT INTO "books" ("body", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "3"], ["title", "C"], ["created_at", "2020-06-09 07:08:34.345978"], ["updated_at", "2020-06-09 07:08:34.345978"]]
---
	def create
    	@book = Book.new(books_params)
    	@books = Book.all
    	if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "AA"], ["body", "11"], ["updated_at", "2020-06-09 08:22:45.046961"], ["id", 7]]
---
	def update
    	@book = Book.find(params[:id])
    	if @book.update(books_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 26]]
---
	def destroy
 		book = Book.find(params[:id])
    	if book.destroy